Revit 2027 API
BuiltInFailures.StairRampFailures.BalustersTooClose Property
 Baluster Separation must be equal to or greater than the Baluster widths.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BalustersTooClose { get; }
Public Shared ReadOnly Property BalustersTooClose As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BalustersTooClose {
	FailureDefinitionId^ get ();
}
static member BalustersTooClose : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace